In [2]:
import pandas as pd

In [16]:
df = pd.DataFrame()
df['Ini'] = [40010000, 40020000, 40024000, 40025000, 40026000]
df['Fim'] = [40015999, 40020999, 40024999, 40025999, 40026999]
df

        Ini       Fim
0  40010000  40015999
1  40020000  40020999
2  40024000  40024999
3  40025000  40025999
4  40026000  40026999

In [13]:
df2 = pd.DataFrame()
df2['Ini'] = [40015970]
df2['Fim'] = [40015975]
df2

        Ini       Fim
0  40015970  40015975

In [89]:

#CRIACAO DO PRIMEIRO DATAFRAME DF
df = pd.DataFrame()
df['Ini'] = [40010000, 40020000, 40024000, 40025000, 40026000]
df['Fim'] = [40015999, 40020999, 40024999, 40025999, 40026999]

#CRIACAO DO SEGUNDO DATAFRAME DF2
df2 = pd.DataFrame()
df2['Ini'] = [40015970]
df2['Fim'] = [40015975]

#ROTINA 
for i2, row2 in df2.iterrows(): #PARA CADA LINHA DO DF2 
    for i, row in df.iterrows(): #PARA CADA LINHA DO DF
        if row2['Ini'] <= row['Fim'] and row2['Ini'] > row['Ini']: #SE INICIO DA LINHA DO DF2 FOR MENOR/IGUAL QUE FIM DA LINHA DO DF E INICIO DA LINHA DO DF2 FOR MAIOR QUE INICIO DA LINHA NO DF....
            previous_fim = row['Fim']  #GUARDA FIM ANTERIOR PARA QUANDO CRIARMOS REGISTRO ADICIONAL
            df.at[i,'Fim'] = row2['Ini']-1 #ALTERA CEP FIM DA LINHA ALVO
            line_to_append = {'Ini': row2['Fim']+1, 'Fim': previous_fim} #CRIA NOVA LINHA ADICIONAL
            df = pd.concat([df, pd.DataFrame([line_to_append])], sort=False) #ADICIONA LINHA ADICIONAL


df.sort_values(by='Ini') #VISUALIZA RESULTADO

#REFERENCES:
# https://stackoverflow.com/questions/16476924/how-to-iterate-over-rows-in-a-dataframe-in-pandas
# https://stackoverflow.com/questions/23330654/update-a-dataframe-in-pandas-while-iterating-row-by-row
# https://pandas.pydata.org/docs/reference/api/pandas.concat.html
# https://stackoverflow.com/questions/18837262/convert-python-dict-into-a-dataframe

        Ini       Fim
0  40010000  40015969
0  40015976  40015999
1  40020000  40020999
2  40024000  40024999
3  40025000  40025999
4  40026000  40026999